/* automatically generated by rust-bindgen */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __STDC_NO_THREADS__: u32 = 1;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 27;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_TYPES_EXT: u32 = 0;
pub const _BITS_TYPES_H: u32 = 1;
pub const _BITS_TYPESIZES_H: u32 = 1;
pub const __OFF_T_MATCHES_OFF64_T: u32 = 1;
pub const __INO_T_MATCHES_INO64_T: u32 = 1;
pub const __RLIM_T_MATCHES_RLIM64_T: u32 = 1;
pub const __FD_SETSIZE: u32 = 1024;
pub const _BITS_WCHAR_H: u32 = 1;
pub const _BITS_STDINT_INTN_H: u32 = 1;
pub const _BITS_STDINT_UINTN_H: u32 = 1;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const TOX_VERSION_MAJOR: u32 = 0;
pub const TOX_VERSION_MINOR: u32 = 2;
pub const TOX_VERSION_PATCH: u32 = 2;
pub const TOX_PUBLIC_KEY_SIZE: u32 = 32;
pub const TOX_SECRET_KEY_SIZE: u32 = 32;
pub const TOX_MAX_NAME_LENGTH: u32 = 128;
pub const TOX_MAX_STATUS_MESSAGE_LENGTH: u32 = 1007;
pub const TOX_MAX_FRIEND_REQUEST_LENGTH: u32 = 1016;
pub const TOX_MAX_MESSAGE_LENGTH: u32 = 1372;
pub const TOX_MAX_CUSTOM_PACKET_SIZE: u32 = 1373;
pub const TOX_HASH_LENGTH: u32 = 32;
pub const TOX_FILE_ID_LENGTH: u32 = 32;
pub const TOX_MAX_FILENAME_LENGTH: u32 = 255;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __max_align_ll: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __max_align_ld: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<max_align_t>())).__max_align_ll as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ll)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<max_align_t>())).__max_align_ld as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ld)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tox {
    _unused: [u8; 0],
}
extern "C" {
    pub fn tox_version_major() -> u32;
}
extern "C" {
    pub fn tox_version_minor() -> u32;
}
extern "C" {
    pub fn tox_version_patch() -> u32;
}
extern "C" {
    /// Return whether the compiled library version is compatible with the passed
    /// version numbers.
    pub fn tox_version_is_compatible(major: u32, minor: u32, patch: u32) -> bool;
}
extern "C" {
    pub fn tox_public_key_size() -> u32;
}
extern "C" {
    pub fn tox_secret_key_size() -> u32;
}
extern "C" {
    pub fn tox_nospam_size() -> u32;
}
extern "C" {
    pub fn tox_address_size() -> u32;
}
extern "C" {
    pub fn tox_max_name_length() -> u32;
}
extern "C" {
    pub fn tox_max_status_message_length() -> u32;
}
extern "C" {
    pub fn tox_max_friend_request_length() -> u32;
}
extern "C" {
    pub fn tox_max_message_length() -> u32;
}
extern "C" {
    pub fn tox_max_custom_packet_size() -> u32;
}
extern "C" {
    pub fn tox_hash_length() -> u32;
}
extern "C" {
    pub fn tox_file_id_length() -> u32;
}
extern "C" {
    pub fn tox_max_filename_length() -> u32;
}
/// User is online and available.
pub const TOX_USER_STATUS_TOX_USER_STATUS_NONE: TOX_USER_STATUS = 0;
/// User is away. Clients can set this e.g. after a user defined
/// inactivity time.
pub const TOX_USER_STATUS_TOX_USER_STATUS_AWAY: TOX_USER_STATUS = 1;
/// User is busy. Signals to other clients that this client does not
/// currently wish to communicate.
pub const TOX_USER_STATUS_TOX_USER_STATUS_BUSY: TOX_USER_STATUS = 2;
/// Represents the possible statuses a client can have.
pub type TOX_USER_STATUS = u32;
/// Normal text message. Similar to PRIVMSG on IRC.
pub const TOX_MESSAGE_TYPE_TOX_MESSAGE_TYPE_NORMAL: TOX_MESSAGE_TYPE = 0;
/// A message describing an user action. This is similar to /me (CTCP ACTION)
/// on IRC.
pub const TOX_MESSAGE_TYPE_TOX_MESSAGE_TYPE_ACTION: TOX_MESSAGE_TYPE = 1;
/// Represents message types for tox_friend_send_message and conference
/// messages.
pub type TOX_MESSAGE_TYPE = u32;
/// Don't use a proxy.
pub const TOX_PROXY_TYPE_TOX_PROXY_TYPE_NONE: TOX_PROXY_TYPE = 0;
/// HTTP proxy using CONNECT.
pub const TOX_PROXY_TYPE_TOX_PROXY_TYPE_HTTP: TOX_PROXY_TYPE = 1;
/// SOCKS proxy for simple socket pipes.
pub const TOX_PROXY_TYPE_TOX_PROXY_TYPE_SOCKS5: TOX_PROXY_TYPE = 2;
/// Type of proxy used to connect to TCP relays.
pub type TOX_PROXY_TYPE = u32;
/// No savedata.
pub const TOX_SAVEDATA_TYPE_TOX_SAVEDATA_TYPE_NONE: TOX_SAVEDATA_TYPE = 0;
/// Savedata is one that was obtained from tox_get_savedata.
pub const TOX_SAVEDATA_TYPE_TOX_SAVEDATA_TYPE_TOX_SAVE: TOX_SAVEDATA_TYPE = 1;
/// Savedata is a secret key of length TOX_SECRET_KEY_SIZE.
pub const TOX_SAVEDATA_TYPE_TOX_SAVEDATA_TYPE_SECRET_KEY: TOX_SAVEDATA_TYPE = 2;
/// Type of savedata to create the Tox instance from.
pub type TOX_SAVEDATA_TYPE = u32;
/// Very detailed traces including all network activity.
pub const TOX_LOG_LEVEL_TOX_LOG_LEVEL_TRACE: TOX_LOG_LEVEL = 0;
/// Debug messages such as which port we bind to.
pub const TOX_LOG_LEVEL_TOX_LOG_LEVEL_DEBUG: TOX_LOG_LEVEL = 1;
/// Informational log messages such as video call status changes.
pub const TOX_LOG_LEVEL_TOX_LOG_LEVEL_INFO: TOX_LOG_LEVEL = 2;
/// Warnings about internal inconsistency or logic errors.
pub const TOX_LOG_LEVEL_TOX_LOG_LEVEL_WARNING: TOX_LOG_LEVEL = 3;
/// Severe unexpected errors caused by external or internal inconsistency.
pub const TOX_LOG_LEVEL_TOX_LOG_LEVEL_ERROR: TOX_LOG_LEVEL = 4;
/// Severity level of log messages.
pub type TOX_LOG_LEVEL = u32;
/// This event is triggered when the toxcore library logs an internal message.
/// This is mostly useful for debugging. This callback can be called from any
/// function, not just tox_iterate. This means the user data lifetime must at
/// least extend between registering and unregistering it or tox_kill.
///
/// Other toxcore modules such as toxav may concurrently call this callback at
/// any time. Thus, user code must make sure it is equipped to handle concurrent
/// execution, e.g. by employing appropriate mutex locking.
///
/// @param level The severity of the log message.
/// @param file The source file from which the message originated.
/// @param line The source line from which the message originated.
/// @param func The function from which the message originated.
/// @param message The log message.
/// @param user_data The user data pointer passed to tox_new in options.
pub type tox_log_cb = ::std::option::Option<
    unsafe extern "C" fn(
        tox: *mut Tox,
        level: TOX_LOG_LEVEL,
        file: *const ::std::os::raw::c_char,
        line: u32,
        func: *const ::std::os::raw::c_char,
        message: *const ::std::os::raw::c_char,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
/// This struct contains all the startup options for Tox. You must tox_options_new to
/// allocate an object of this type.
///
/// WARNING: Although this struct happens to be visible in the API, it is
/// effectively private. Do not allocate this yourself or access members
/// directly, as it *will* break binary compatibility frequently.
///
/// @deprecated The memory layout of this struct (size, alignment, and field
/// order) is not part of the ABI. To remain compatible, prefer to use tox_options_new to
/// allocate the object and accessor functions to set the members. The struct
/// will become opaque (i.e. the definition will become private) in v0.3.0.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tox_Options {
    /// The type of socket to create.
    ///
    /// If this is set to false, an IPv4 socket is created, which subsequently
    /// only allows IPv4 communication.
    /// If it is set to true, an IPv6 socket is created, allowing both IPv4 and
    /// IPv6 communication.
    pub ipv6_enabled: bool,
    /// Enable the use of UDP communication when available.
    ///
    /// Setting this to false will force Tox to use TCP only. Communications will
    /// need to be relayed through a TCP relay node, potentially slowing them down.
    /// Disabling UDP support is necessary when using anonymous proxies or Tor.
    pub udp_enabled: bool,
    /// Enable local network peer discovery.
    ///
    /// Disabling this will cause Tox to not look for peers on the local network.
    pub local_discovery_enabled: bool,
    /// Pass communications through a proxy.
    pub proxy_type: TOX_PROXY_TYPE,
    /// The IP address or DNS name of the proxy to be used.
    ///
    /// If used, this must be non-NULL and be a valid DNS name. The name must not
    /// exceed 255 characters, and be in a NUL-terminated C string format
    /// (255 chars + 1 NUL byte).
    ///
    /// This member is ignored (it can be NULL) if proxy_type is TOX_PROXY_TYPE_NONE.
    ///
    /// The data pointed at by this member is owned by the user, so must
    /// outlive the options object.
    pub proxy_host: *const ::std::os::raw::c_char,
    /// The port to use to connect to the proxy server.
    ///
    /// Ports must be in the range (1, 65535). The value is ignored if
    /// proxy_type is TOX_PROXY_TYPE_NONE.
    pub proxy_port: u16,
    /// The start port of the inclusive port range to attempt to use.
    ///
    /// If both start_port and end_port are 0, the default port range will be
    /// used: [33445, 33545].
    ///
    /// If either start_port or end_port is 0 while the other is non-zero, the
    /// non-zero port will be the only port in the range.
    ///
    /// Having start_port > end_port will yield the same behavior as if start_port
    /// and end_port were swapped.
    pub start_port: u16,
    /// The end port of the inclusive port range to attempt to use.
    pub end_port: u16,
    /// The port to use for the TCP server (relay). If 0, the TCP server is
    /// disabled.
    ///
    /// Enabling it is not required for Tox to function properly.
    ///
    /// When enabled, your Tox instance can act as a TCP relay for other Tox
    /// instance. This leads to increased traffic, thus when writing a client
    /// it is recommended to enable TCP server only if the user has an option
    /// to disable it.
    pub tcp_port: u16,
    /// Enables or disables UDP hole-punching in toxcore. (Default: enabled).
    pub hole_punching_enabled: bool,
    /// The type of savedata to load from.
    pub savedata_type: TOX_SAVEDATA_TYPE,
    /// The savedata.
    ///
    /// The data pointed at by this member is owned by the user, so must
    /// outlive the options object.
    pub savedata_data: *const u8,
    /// The length of the savedata.
    pub savedata_length: usize,
    /// Logging callback for the new tox instance.
    pub log_callback: tox_log_cb,
    /// User data pointer passed to the logging callback.
    pub log_user_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_Tox_Options() {
    assert_eq!(
        ::std::mem::size_of::<Tox_Options>(),
        64usize,
        concat!("Size of: ", stringify!(Tox_Options))
    );
    assert_eq!(
        ::std::mem::align_of::<Tox_Options>(),
        8usize,
        concat!("Alignment of ", stringify!(Tox_Options))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).ipv6_enabled as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(ipv6_enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).udp_enabled as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(udp_enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tox_Options>())).local_discovery_enabled as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(local_discovery_enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).proxy_type as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(proxy_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).proxy_host as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(proxy_host)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).proxy_port as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(proxy_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).start_port as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(start_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).end_port as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(end_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).tcp_port as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(tcp_port)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tox_Options>())).hole_punching_enabled as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(hole_punching_enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).savedata_type as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(savedata_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).savedata_data as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(savedata_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).savedata_length as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(savedata_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).log_callback as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(log_callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).log_user_data as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(log_user_data)
        )
    );
}
extern "C" {
    pub fn tox_options_get_ipv6_enabled(options: *const Tox_Options) -> bool;
}
extern "C" {
    pub fn tox_options_set_ipv6_enabled(options: *mut Tox_Options, ipv6_enabled: bool);
}
extern "C" {
    pub fn tox_options_get_udp_enabled(options: *const Tox_Options) -> bool;
}
extern "C" {
    pub fn tox_options_set_udp_enabled(options: *mut Tox_Options, udp_enabled: bool);
}
extern "C" {
    pub fn tox_options_get_local_discovery_enabled(options: *const Tox_Options) -> bool;
}
extern "C" {
    pub fn tox_options_set_local_discovery_enabled(
        options: *mut Tox_Options,
        local_discovery_enabled: bool,
    );
}
extern "C" {
    pub fn tox_options_get_proxy_type(options: *const Tox_Options) -> TOX_PROXY_TYPE;
}
extern "C" {
    pub fn tox_options_set_proxy_type(options: *mut Tox_Options, type_: TOX_PROXY_TYPE);
}
extern "C" {
